docs: use mermaid for architecture diagram (#783)
Closes #783
